posts/bag-of-words-and-ngram-model/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="bag of words and ngram model">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>词袋模型和N-gram模型 | Astropeak</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://example.com/posts/bag-of-words-and-ngram-model/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Astropeak">
<link rel="next" href="../recall-precision-fscore/" title="Recall，Precision 和 F-score" type="text/html">
<meta property="og:site_name" content="Astropeak">
<meta property="og:title" content="词袋模型和N-gram模型">
<meta property="og:url" content="https://example.com/posts/bag-of-words-and-ngram-model/">
<meta property="og:description" content="bag of words and ngram model">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-01-13T16:29:35+08:00">
<meta property="article:tag" content="language model">
<meta property="article:tag" content="nlp">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Astropeak</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">词袋模型和N-gram模型</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Astropeak
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-01-13T16:29:35+08:00" itemprop="datePublished" title="2017-01-13 16:29">2017-01-13 16:29</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
词袋模型(bag of words)是常用的语言模型，将文档看作文档中所有词的集合，而忽略词的顺序。尽管丢失了词的顺序这一属性，
但这个模型仍然能够有效用于一些自然处理任务中，如文本分类。
</p>

<p>
N-gram模型是对词袋模型的扩展，N为一个数字，以N＝2为例，2-gram模型将文档看作文档中所有相邻两个词这些词对的集合，
也忽略这些词对在文档中出现的顺序。词袋模型是当N＝1时的特例。
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">例子</h2>
<div class="outline-text-2" id="text-1">
<p>
对于如下文档：
</p>
<pre class="example">
The brown fox jump up the rog.
</pre>

<p>
对应的词袋模型为：
</p>
<pre class="example">
(The, brown, fox, jump, up, the, rog)
</pre>

<p>
对应的2-gram模型为：
</p>
<div class="highlight"><pre><span></span>((The, brown), (brown, fox), (fox, jump), (jump, up), (up, the), (the, rog))
</pre></div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">文档表示</h2>
<div class="outline-text-2" id="text-2">
<p>
将文档表示成词袋模型后,就可以进行定量的分析。一种简单的方式是判断这个文档中是否出现词汇表中某一个词，因此可以将文档表示成一个由0和1组成的向量。
</p>

<p>
如果语言的词汇表如下:
</p>
<pre class="example">
(a, boy, the, cute, likes, dog, little, girl)
</pre>

<p>
则文档与向量表示的对应关系如下.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
</colgroup>
<thead><tr>
<th scope="col" class="left">文档</th>
<th scope="col" class="left">向量表示</th>
</tr></thead>
<tbody>
<tr>
<td class="left">a little girl</td>
<td class="left">[1, 0, 0, 0, 0, 0, 1, 1]</td>
</tr>
<tr>
<td class="left">the body likes the dog</td>
<td class="left">[0, 1, 1, 0, 1, 1, 0, 0]</td>
</tr>
</tbody>
</table>
<p>
其中向量中的每个元素表示这个文档中是否包含某个词. 如第一向量, 最后一个 1 表示它包含 girl这个词.
</p>

<p>
进一步的可以考虑词语频率(term frequency, TF)的影响，相当于是在前一个表示的模型新增了词语频率这一信息。
词的频率此时可以作为某种度量的权重.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="left">
<col class="left">
</colgroup>
<thead><tr>
<th scope="col" class="left">文档</th>
<th scope="col" class="left">向量表示</th>
</tr></thead>
<tbody>
<tr>
<td class="left">a little girl</td>
<td class="left">[1, 0, 0, 0, 0, 0, 1, 1]</td>
</tr>
<tr>
<td class="left">the body likes the dog</td>
<td class="left">[0, 1, 2, 0, 1, 1, 0, 0]</td>
</tr>
</tbody>
</table>
<p>
第二个向量的第三元素值为2,表示 the 在这个文档中出现了两次.
</p>


<p>
有些词出现的频率非常高，可能在每一篇文档中都会出现，因此引入文档频率(doc frequency, DF)，
也即一个词在所有文档中出现的频率。 如果这个频率很高，那么这个词可能是一个停止词， 需要将其移除，
因为它对文档分类没有帮助。
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">与语言模型的关系</h2>
<div class="outline-text-2" id="text-3">
<p>
词袋模型是语音模型的一种简化形式。语言模型是给定一个词汇表，然后求所有的词的序列的概率。
词袋模型则是将这个词的序列的范围大大缩小，词的序列只包含由单个词所组成的序列，则每个序列的概率则等于词频率。
</p>


<p>
语言模型的详细介绍见<a href="language-model.html">这里</a>.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">在信息检索中的应用</h2>
<div class="outline-text-2" id="text-4">
<p>
信息检索要解决的问题是:给定一组关键字, 在所有的文档集合中, 返回与关键字相关的所有文档, 并对所有文档根据相关性进行排序.
</p>

<p>
基本的处理方法为: 首先将所有文档表示为词袋模型,表示为一个向量,然后查询搜索关键字是否包含在这个向量里,
这样便可以计算出所有与给定关键字相关的文档. 排序文档时,可能根据词频-逆文档频率(TF-IDF)进行排序.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">在文本分类的应用</h2>
<div class="outline-text-2" id="text-5">
<p>
使用词袋模型的向量表示将每个文档表示为数学的形式,然后再输入到具体机器学习算法中.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/language-model/" rel="tag">language model</a></li>
            <li><a class="tag p-category" href="../../categories/nlp/" rel="tag">nlp</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="next">
                <a href="../recall-precision-fscore/" rel="next" title="Recall，Precision 和 F-score">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:n.tesla@example.com">Astropeak</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
